As can be seen here, it is possible for the API endpoint to return a nil response and no errors:
https://github.com/hashicorp/vault-plugin-secrets-gcp/blob/2ad4a7fbf9b9ccccde31971d4740da6882f308ce/plugin/path_config.go#L76-L83

I was not able to reproduce the problem as described in https://hashicorp.atlassian.net/browse/VAULT-38638, but a simple way to trigger the same panic is demonstrated here:

```
❯ ls -al
total 8
drwxr-xr-x   3 vrizo  staff   96 Aug  7 10:51 .
drwxr-xr-x  12 vrizo  staff  384 Aug  7 10:46 ..
-rw-r--r--   1 vrizo  staff  432 Aug  7 10:45 main.tf
❯ cat main.tf
provider "vault" {
  address = "http://127.0.0.1:8200"
  token = "devroot"
}

resource "vault_gcp_secret_backend" "gcp_backend" {
  path        = "gcp"
  credentials = <<EOF
{
  "hello": "world"
}
EOF
}
❯ terraform apply -auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vault in /Users/victor/.terraform.d/plugins
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with
│ published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vault_gcp_secret_backend.gcp_backend will be created
  + resource "vault_gcp_secret_backend" "gcp_backend" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + credentials                  = (sensitive value)
      + credentials_wo               = (write-only attribute)
      + default_lease_ttl_seconds    = 0
      + disable_remount              = false
      + external_entropy_access      = false
      + force_no_cache               = (known after apply)
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = 0
      + path                         = "gcp"
      + seal_wrap                    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vault_gcp_secret_backend.gcp_backend: Creating...
vault_gcp_secret_backend.gcp_backend: Creation complete after 0s [id=gcp]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
❯ vault secrets disable gcp
Success! Disabled the secrets engine (if it existed) at: gcp/
❯ vault secrets enable gcp
Success! Enabled the gcp secrets engine at: gcp/
❯ terraform plan
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vault in /Users/victor/.terraform.d/plugins
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with
│ published releases.
╵
vault_gcp_secret_backend.gcp_backend: Refreshing state... [id=gcp]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Plugin did not respond
│
│   with vault_gcp_secret_backend.gcp_backend,
│   on main.tf line 6, in resource "vault_gcp_secret_backend" "gcp_backend":
│    6: resource "vault_gcp_secret_backend" "gcp_backend" {
│
│ The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ReadResource call. The plugin logs may contain more
│ details.
╵

Stack trace from the terraform-provider-vault plugin:

panic: runtime error: invalid memory address or nil pointer dereference
[signal SIGSEGV: segmentation violation code=0x2 addr=0x30 pc=0x100de7808]

goroutine 50 [running]:
github.com/hashicorp/terraform-provider-vault/vault.gcpSecretBackendRead({0x10166c090, 0x14000526a80}, 0x14000a26280, {0x1015b2ca0, 0x140000b4040})
	/Users/victor/hc/terraform-provider-vault/vault/resource_gcp_secret_backend.go:249 +0x518
github.com/hashicorp/terraform-provider-vault/vault.gcpSecretBackendResource.ReadContextWrapper.func3({0x10166c090, 0x14000526a80}, 0x14000a26280, {0x1015b2ca0, 0x140000b4040})
	/Users/victor/hc/terraform-provider-vault/internal/provider/provider.go:246 +0x70
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).read(0x14000633000, {0x10166bfe8, 0x14000a2a5d0}, 0x14000a26280, {0x1015b2ca0, 0x140000b4040})
	/Users/victor/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.36.1/helper/schema/resource.go:855 +0xe4
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).RefreshWithoutUpgrade(0x14000633000, {0x10166bfe8, 0x14000a2a5d0}, 0x14000510d00, {0x1015b2ca0, 0x140000b4040})
	/Users/victor/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.36.1/helper/schema/resource.go:1149 +0x40c
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ReadResource(0x1400000db30, {0x10166bfe8?, 0x14000a2a510?}, 0x1400096c280)
	/Users/victor/go/pkg/mod/github.com/hashicorp/terraform-plugin-sdk/v2@v2.36.1/helper/schema/grpc_provider.go:739 +0x5b0
github.com/hashicorp/terraform-plugin-mux/tf5muxserver.(*muxServer).ReadResource(0x14000907f00, {0x10166bfe8?, 0x14000a2a240?}, 0x1400096c280)
	/Users/victor/go/pkg/mod/github.com/hashicorp/terraform-plugin-mux@v0.18.0/tf5muxserver/mux_server_ReadResource.go:35 +0x17c
github.com/hashicorp/terraform-plugin-go/tfprotov5/tf5server.(*server).ReadResource(0x1400069e320, {0x10166bfe8?, 0x1400096f6b0?}, 0x14000526230)
	/Users/victor/go/pkg/mod/github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov5/tf5server/server.go:784 +0x210
github.com/hashicorp/terraform-plugin-go/tfprotov5/internal/tfplugin5._Provider_ReadResource_Handler({0x10161fc00, 0x1400069e320}, {0x10166bfe8, 0x1400096f6b0}, 0x140008b7b00, 0x0)
	/Users/victor/go/pkg/mod/github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov5/internal/tfplugin5/tfplugin5_grpc.pb.go:575 +0x1c0
google.golang.org/grpc.(*Server).processUnaryRPC(0x140001a9800, {0x10166bfe8, 0x1400096f650}, 0x140000586c0, 0x1400067ff20, 0x10219c6c8, 0x0)
	/Users/victor/go/pkg/mod/google.golang.org/grpc@v1.69.4/server.go:1392 +0xc38
google.golang.org/grpc.(*Server).handleStream(0x140001a9800, {0x10166c908, 0x1400085a000}, 0x140000586c0)
	/Users/victor/go/pkg/mod/google.golang.org/grpc@v1.69.4/server.go:1802 +0x900
google.golang.org/grpc.(*Server).serveStreams.func2.1()
	/Users/victor/go/pkg/mod/google.golang.org/grpc@v1.69.4/server.go:1030 +0x84
created by google.golang.org/grpc.(*Server).serveStreams.func2 in goroutine 42
	/Users/victor/go/pkg/mod/google.golang.org/grpc@v1.69.4/server.go:1041 +0x138

Error: The terraform-provider-vault plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.
```
